msc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-10-16 Sun 15:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mathematics Subject Classification</title>
<meta name="author" content="Vaibhav Karve" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="css/stylesheet.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Mathematics Subject Classification
<br />
<span class="subtitle"><a href="index.html">Home</a></span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbeebaae">1. Note to self</a></li>
<li><a href="#orgfc80a4e">2. My interests with corresponding indices</a></li>
<li><a href="#orgc143966">3. <span class="todo TODO">TODO</span> ACM computing classification system 2012</a></li>
<li><a href="#org102795c">4. <span class="todo TODO">TODO</span> arXiv.org math classification</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgbeebaae" class="outline-2">
<h2 id="orgbeebaae"><span class="section-number-2">1.</span> Note to self</h2>
<div class="outline-text-2" id="text-1">
<p>
I have tried to look through the <a href="https://zbmath.org/static/msc2020.pdf">2020 Mathematics Subject
Classification</a> and select subjects that my research interests align
with. This is a good exercise for clearing up my thoughts on where my
research is currently and where it is headed. This exercise should be
carried out once a year at least.
</p>

<p>
I last updated this list on 2020-09-29.
</p>
</div>
</div>

<div id="outline-container-orgfc80a4e" class="outline-2">
<h2 id="orgfc80a4e"><span class="section-number-2">2.</span> My interests with corresponding indices</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>03 : Mathematical logic and foundations
<ul class="org-ul">
<li>Overall heading : General/foundations [Study of foundations of mathematics and logic]</li>
<li>03-04 : Software, source code, etc.  for problems pertaining to mathematical logic and foundations</li>
<li>03-08 : Computational methods for problems pertaining to mathematical logic and foundations</li>
<li>03Bxx : General logic
<ul class="org-ul">
<li>03B35 : Mechanization of proofs and logical operations [See also 68V15]</li>
<li>03B38 : Type theory</li>
<li>03B40 : Combinatory logic and lambda calculus [See also 68N18]</li>
<li>03B70 : Logic in computer science [See also 68-xx]</li>
</ul></li>
<li>03Dxx : Computability and recursion theory
<ul class="org-ul">
<li>03D15 : Complexity of computation (including implicit computational complexity) [See also 68Q15, 68Q17]</li>
</ul></li>
</ul></li>

<li>05 : Combinatorics
<ul class="org-ul">
<li>Overall heading : Discrete mathematics/algebra [Study of structure of mathematical abstractions]</li>
<li>05-04 : Software, source code, etc. for problems pertaining to combinatorics</li>
<li>05-08 : Computational methods for problems pertaining to combinatorics</li>
<li>05Cxx : Graph theory
<ul class="org-ul">
<li>05C30 : Enumeration in graph theory</li>
<li>05C65 : Hypergraphs</li>
<li>05C75 : Structural characterization of families of graphs</li>
<li>05C76 : Graph operations (line graphs, products, etc.)</li>
<li>05C83 : Graph minors</li>
<li>05C85 : Graph algorithms (graph-theoretic aspects) [See also 68R10, 68W05]</li>
<li>05C90 : Applications of graph theory [See also 68R10, 90C35]</li>
</ul></li>
</ul></li>

<li>68 : Computer science
<ul class="org-ul">
<li>Overall heading : Applied mathematics / other [Study of applications of mathematical abstractions]</li>
<li>68-04 : Software, source code, etc.  for problems pertaining to computer science</li>
<li>68Nxx : Theory of software
<ul class="org-ul">
<li>68N01 : General topics in the theory of software</li>
<li>68N15 : Theory of programming languages</li>
<li>68N17 : Logic programming</li>
<li>68N18 : Functional programming and lambda calculus [See also 03B40]</li>
</ul></li>
<li>68Qxx : Theory of computing
<ul class="org-ul">
<li>68Q15 : Complexity classes (hierarchies, relations among complexity classes, etc.)  [See also 03D15, 68Q17]</li>
<li>68Q17 : Computational difficulty of problems (lower bounds, completeness, difficulty of approximation, etc.)  [See also 68Q15]</li>
<li>68Q25 : Analysis of algorithms and problem complexity [See also 68W40]</li>
<li>68Q42 : Grammars and rewriting systems</li>
</ul></li>
<li>68Rxx : Discrete mathematics in relation to computer science
<ul class="org-ul">
<li>68R07 : Computational aspects of satisfiability</li>
<li>68R10 : Graph theory (including graph drawing) in computer science [See also 05Cxx, 90C35]</li>
</ul></li>
<li>68Vxx : Computer science support for mathematical research and practice 
<ul class="org-ul">
<li>68V05 : Computer assisted proofs of proofs-by-exhaustion type</li>
<li>68V15 : Theorem proving (automated and interactive theorem provers, deduction, resolution, etc.) [See also 03B35]</li>
<li>68V20 : Formalization of mathematics in connection with theorem provers [See also 03B35, 68V15]</li>
</ul></li>
<li>68Wxx : Algorithms  in  computer  science {For combinatorics and graph theory, see 05C85, 68Rxx}</li>
<li>68W05 : Nonnumerical algorithms</li>
<li>68W40 : Analysis of algorithms [See also 68Q25]</li>
</ul></li>

<li>90 : Operations research, mathematical programming
<ul class="org-ul">
<li>90Cxx : Mathematical programming 
<ul class="org-ul">
<li>90C27 : Combinatorial optimization</li>
<li>90C35 : Programming involving graphs or networks [See also 90C27]</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgc143966" class="outline-2">
<h2 id="orgc143966"><span class="section-number-2">3.</span> <span class="todo TODO">TODO</span> ACM computing classification system 2012</h2>
</div>
<div id="outline-container-org102795c" class="outline-2">
<h2 id="org102795c"><span class="section-number-2">4.</span> <span class="todo TODO">TODO</span> arXiv.org math classification</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Vaibhav Karve</p>
<p class="date">Created: 2022-10-16 Sun 15:11</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
